---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionAccessor.GetSeverity
source: html/f8478f10-dd43-f4b7-3ed2-3daef25e548f.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor.GetSeverity Method

Retrieves severity of the failure.

## Syntax (C#)
```csharp
public FailureSeverity GetSeverity()
```

## Returns
The severity of the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The FailureDefinitionAccessor has not been properly initialized.